## min-max스케일링 기준 상하위 5% 구하기
### 주어진 데이터에서 'f5'컬럼을 min-max 스케일 변환한 후, 상위 5%와 하위 5% 값의 합을 구하시오


- 데이터셋 : basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작
- File -> Editor Type -> Script

In [9]:
# !pip install scikit-learn 필요하다면 다운

### 모듈 및 데이터 불러오기

In [4]:
import pandas as pd
import numpy as np 
import os

os.getcwd()

df = pd.read_csv('data/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

### 'f5'columns, min-max 스케일링

In [10]:
## 방법 1. sklearn 메소드 사용. 

from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df['f5_1'] = scaler.fit_transform(df[['f5']])
df.head()

     id   age city    f1  f2   f3    f4         f5      f5_1
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  0.219708

In [14]:
# 방법 2. 수식을 만들어서 이용. (수식을 잊지말자..)

df['f5_2'] = (df['f5'] - df['f5'].min()) / (df['f5'].max() - df['f5'].min())
df.head()

# df['f5'].transform(lambda x: ((x - x.min()) / (x.max() - x.min()))) // 굳,,이?

     id   age city    f1  f2   f3    f4         f5      f5_1      f5_2
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  0.919533  0.919533
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  0.570252  0.570252
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  0.084129  0.084129
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  0.483685  0.483685
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  0.219708  0.219708

### 상, 하위 5% 구하기 

이렇게 상위 5%인지 상위 5개인지 확인 꼭하기!

In [20]:
# 이건 탑 5, 워스타 5인것 같음. 

high = df.f5_1.sort_values(ascending = False)[:5]
print(high.index)
low = df.f5_1.sort_values(ascending = True)[:5]
print(low.index)

Int64Index([10, 97, 9, 76, 98], dtype='int64')
Int64Index([14, 6, 90, 44, 54], dtype='int64')

In [22]:
# 하위 5%, 상위 5% 값 구하기

lower = df['f5_1'].quantile(0.05)
print(lower)

upper = df['f5_1'].quantile(0.95)
print(upper)

print(lower + upper)

0.03670782406038746
0.9881662742993513
1.0248740983597389